/*
 * @Author: gongxiaofei
 * @Date: 2022-09-23 09:31:37
 * @LastEditors: gongxiaofei
 * @LastEditTime: 2022-09-23 13:58:24
 * @Description: 正则表达式
 */
export const regulars = [
  {
    title: '统一社会信用代码',
    value: '/^[0-9A-HJ-NPQRTUWXY]{2}\\d{6}[0-9A-HJ-NPQRTUWXY]{10}$/'
  },
  {
    title: '统一社会信用代码(宽松匹配)',
    value: '/^(([0-9A-Za-z]{15})|([0-9A-Za-z]{18})|([0-9A-Za-z]{20}))$/'
  },
  {
    title: '手机号-中国(严谨)',
    value: '/^(?:(?:\\+|00)86)?1(?:(?:3[\\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\\d])|(?:9[189]))\\d{8}$/'
  },
  {
    title: '手机号-中国(宽松)',
    value: '/^(?:(?:\\+|00)86)?1[3-9]\\d{9}$/'
  },
  {
    title: '座机(国内)',
    value: '/^(?:(?:\\d{3}-)?\\d{8}|^(?:\\d{4}-)?\\d{7,8})(?:-\\d+)?$/'
  },
  {
    title: '身份证号码(2代)',
    value: '/^[1-9]\\d{5}(?:18|19|20)\\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\\d|30|31)\\d{3}[\\dXx]$/'
  },
  {
    title: '香港身份证',
    value: '/^[a-zA-Z]\\d{6}\\([\\dA]\\)$/'
  },
  {
    title: '澳门身份证',
    value: '/^[1|5|7]\\d{6}\\(\\d\\)$/'
  },
  {
    title: '台湾身份证',
    value: '/^[a-zA-Z][0-9]{9}$/'
  },
  {
    title: '护照(包含香港、澳门)',
    value: '/(^[EeKkGgDdSsPpHh]\\d{8}$)|(^(([Ee][a-fA-F])|([DdSsPp][Ee])|([Kk][Jj])|([Mm][Aa])|(1[45]))\\d{7}$)/'
  },
  {
    title: '中国邮政编码',
    value: '/^(0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\\d{4}$/'
  },
  {
    title: '车牌(新能源)',
    value:' /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z](?:((\\d{5}[A-HJK])|([A-HJK][A-HJ-NP-Z0-9][0-9]{4}))|[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳])$/'
  },
  {
    title: '车牌(非新能源)',
    value:' /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]$/'
  },
  {
    title: 'email(邮箱)',
    value: '/^(([^<>()[\\]\\\\.,;:\\s@"]+(\\.[^<>()[\\]\\\\.,;:\\s@"]+)*)|(".+"))@((\\[[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\])|(([a-zA-Z\\-0-9]+\\.)+[a-zA-Z]{2,}))$/'
  }
]